# bool_list
# a = 1 # int
# b = 3.14 # float
# c = '메가스터디 짱짱' #str
# d = True #bool [True,False]
# e = False # bool [True,False]
# bool()

# 대부분 값을 True
# 비어있는 값 or 0 이면 False
# boolA = bool(a)
# print(boolA)

# boolB = bool(0)
# print(boolB)

# empty = ''
# boolEmpty = bool(empty)
# print(boolEmpty)

# List type
# coffee = ['아메리카노', '카페라떼', '맥심커피','바닐라라떼']
# [index]
# bus_number = [10,177,173,200,7026]

# 리스트 안에 any 타입 가능
#mega = [[1, 3, 5], [5, 6, 7], [1, 5, 9]]
print(f"C언어 마지막 강의 날짜:{mega[0][2]}) # c언어 강의 날짜 리스트 마지막 날짜
print(f"뱀언어 두번째 강의 날짜:{mega[2][1]}) # c언어 강의 날짜 리스트 마지막 날짜

# list() # 리스트화
# numList = List(1,2,3,4,5) # 정수를 리스트화
#mega = list("megastudy")
print(mega)

"""사실은 오늘 너와의 만남을 정리하고 싶어
널 만날 거야, 이런 날 이해해
어렵게 맘 정한 거라 네게 말할 거지만
사실 오늘 아침에 그냥 나 생각한 거야
햇살에 일어나 보니 너무나 눈부셔
모든 게 다 변한 거야, 널 향한 마음도
그렇지만 널 사랑 않는 게 아냐
이제는 나를 변화시킬 테니까
너 몰래몰래, 몰래 다른 여자들과 비교, 비교했지
자꾸만 깨어지는 환상 속에 혼자서 울고 있는
초라하게 갇혀 버린 나를 보았어
널 떠날 거야 음, 널 떠날 거야, 음
하지만 아직까지 사랑하는걸
그래, 그렇지만 내 맘속에 너를 잊어갈 거야
머리 위로 비친 내 하늘 바라다보며
널 향한 마음을 이제는 굳혔지만
웬일인지 네게 더 다가갈수록
우린 같은 하늘 아래 서 있었지
"단지 널 사랑해" 이렇게 말했지
이제껏 준비했던 많은 말을 뒤로한 채
언제나 니 옆에 있을게
이렇게 약속을 하겠어 저 하늘을 바라다보며
내게 하늘이 열려 있어
그래그래, 너는 내 앞에 서 있고
(그래그래, 너는 내 앞에 서 있고) 그래, 다른 연인들은 키스를 해
하지만 항상 나는 너의 뒤에 있어야만 해
(그래, 다른 연인들은 키스를 해) 이제 그만해 음, 나도 남잔데 음
내 마음 너도 알고 있는 걸 알아
그래, 이제 나도 지쳐서 하늘만 바라볼 수밖에 (왜 너의 뒤에 있어야 할까?)
햇살에 일어나 보니 너무나 눈부셔
모든 게 다 변한 거야 널 향한 마음도
그렇지만 널 사랑 않는 게 아냐
이제는 나를 변화시킬 테니까
머리 위로 비친 내 하늘 바라다보며
널 향한 마음을 이제는 굳혔지만
웬일인지 네게 더 다가갈수록
우린 같은 하늘 아래 서 있었지
"단지 널 사랑해" 이렇게 말했지
이제껏 준비했던 많은 말을 뒤로한 채
언제나 니 옆에 있을게
이렇게 약속을 하겠어, 저 하늘을 바라보며
한 번 더, 한 번 더 말했지
이제껏 준비했던 (이제껏 많은 말을 뒤로한 채)
많은 말을 뒤로한 채 (다시 널 사랑한다고 했지)
언제나 니 옆에 있을게
다신 너 혼자 아냐, 너의 곁엔 내가 있잖아"""


cant_list = list(candy)
print(candy_list)








